{"date": "2025-12-24", "categories": [{"name": "Multiagent Systems", "count": 1, "papers": [{"index": "#10", "title": "Reflection-Driven Self-Optimization 6G Agentic AI RAN via Simulation-in-the-Loop Workflows", "link": "/arxiv/2512.20640", "arxiv_id": "2512.20640", "authors": "Yunhao Hu, Xinchen Lyu, Chenshan Ren, Keda Chen, Qimei Cui, Xiaofeng Tao", "summary": "The escalating complexity of sixth-generation (6G) networks demands unprecedented levels of autonomy beyond the capabilities of traditional optimization-based and current AI-based resource management approaches. While agentic AI has emerged as a promising paradigm for autonomous RAN, current frameworks provide sophisticated reasoning capabilities but lack mechanisms for empirical validation and self-improvement. This article identifies simulation-in-the-loop validation as a critical enabler for truly autonomous networks, where AI agents can empirically verify decisions and learn from outcomes. We present the first reflection-driven self-optimization framework that integrates agentic AI with high-fidelity network simulation in a closed-loop architecture. Our system orchestrates four specialized agents, including scenario, solver, simulation, and reflector agents, working in concert to transform agentic AI into a self-correcting system capable of escaping local optima, recognizing implicit user intent, and adapting to dynamic network conditions. Extensive experiments validate significant performance improvements over non-agentic approaches: 17.1\\% higher throughput in interference optimization, 67\\% improved user QoS satisfaction through intent recognition, and 25\\% reduced resource utilization during low-traffic periods while maintaining service quality.", "subjects": "Networking and Internet Architecture, Multiagent Systems", "date": "2025-12-08", "category": "cs.MA", "crawl_time": "2025-12-29T11:00:03.483590", "filter_reason": "这篇论文符合筛选标准，应予以保留。判断依据如下： 1.  **核心贡献符合“自我演化”与“多智能体”方向**： 论文的核心贡献是提出了一种“反思驱动的自我优化框架”，这直接对应研究焦点中的“自我演化”和“自我反思”。论文构建了一个包含四个专门智能体（场景、求解器、模拟、反思智能体）的闭环架构，旨在通过经验验证和反思机制实现系统的自我修正和迭代改进，这属于构建新的Agentic框架和方法论。 2.  **符合“自我演化的应用”例外规则**： 根据筛选标准第四步第2点，虽然论文的应用领域是特定的6G网络（RAN），但其核心在于提出了一种新的“自我演化”机制（Simulation-in-the-Loop + Reflection-driven），而不仅仅是将现有智能体作为工具应用。因此，符合“保留”的例外条件。 3.  **包含关键正面指标**： 论文明确涉及了 `Multi-Agent Systems`（多智能体协作）、`Self-Reflection`（反思智能体）、`Self-Correction`（自我修正）和 `Self-Optimization`（自我优化）等核心关键词。 综上所述，该论文在特定领域（6G）中验证了具有自我演化能力的多智能体框架，符合关于“LLM智能体及其演化”的研究课题要求。", "summary2": "本文旨在解决6G网络中现有Agentic AI缺乏经验验证与自我改进机制的问题。针对多小区RAN场景，我们提出了一种Reflection-Driven Self-Optimization Framework，通过Simulation-in-the-Loop工作流协调Scenario、Solver、Simulation和Reflector四个Agent。我们在Sionna平台上通过吞吐量、QoS满意度和资源利用率等指标验证了其有效性，实现了显著的性能提升。", "inspiration_trace": "生成灵感溯源时发生错误", "summary_translation": "翻译失败", "summary_generated_time": "2026-01-09 14:58:37", "summary_model": "z-ai/glm-4.7"}]}], "overview": "# 今日AI论文速览 (2025-12-24)\n\n生成每日速览时发生错误: Connection error."}