{"date": "2025-12-31", "categories": [{"name": "Artificial Intelligence", "count": 1, "papers": [{"index": "#12", "title": "Group Deliberation Oriented Multi-Agent Conversational Model for Complex Reasoning", "link": "/arxiv/2512.24613", "arxiv_id": "2512.24613", "authors": "Zheyu Shi, Dong Qiu, Shanlong Yu", "summary": "This paper proposes a group deliberation oriented multi-agent conversational model to address the limitations of single large language models in complex reasoning tasks. The model adopts a three-level role division architecture consisting of generation, verification, and integration. An opinion generation agent produces diverse reasoning perspectives, an evidence verification agent retrieves external knowledge and quantifies factual support, and a consistency arbitration agent integrates logically coherent conclusions. A self-game mechanism is introduced to expand multi-path reasoning trajectories, while a retrieval enhancement module dynamically supplements external knowledge. A composite reward function combining factual consistency and logical coherence is designed, and an improved proximal policy optimization strategy is applied for collaborative training. Experimental results show that the proposed model improves multi-hop reasoning accuracy by 16.8 percent on HotpotQA, 14.3 percent on 2WikiMultihopQA, and 19.2 percent on MeetingBank, while improving consistency by 21.5 percent. The model achieves higher reasoning efficiency than mainstream multi-agent approaches, providing an effective and stable solution for complex reasoning tasks.", "subjects": "Artificial Intelligence", "date": "2025-12-31", "category": "cs.AI", "crawl_time": "2026-01-05T11:00:05.488211", "filter_reason": "这篇论文完全符合我的研究范围，属于“多智能体”和“自我演化”方向的交叉研究。 1.  **核心贡献符合多智能体系统 (Multi-Agent)**: 论文的核心是提出了一种“面向群体商议的多智能体对话模型”。它构建了一个包含三个不同角色的智能体架构：意见生成智能体、证据验证智能体和一致性仲裁智能体。这直接对应了我筛选标准中的“多智能体”方向，特别是智能体间的协作、通信和角色分工。 2.  **包含自我演化机制**: 论文中明确引入了“自我博弈机制”来扩展多路径推理轨迹，并设计了复合奖励函数结合改进的近端策略优化（PPO）策略进行协作训练。这种通过反馈和强化学习进行迭代优化的过程，符合“自我演化”中关于智能体通过环境反馈进行自我完善和迭代的标准。 3.  **具备智能体关键能力**: 论文模型包含检索增强模块，体现了“工具使用”能力；同时，其通过多智能体商议解决复杂推理任务的过程，涉及了复杂的“规划”和“多步推理”。 4.  **排除标准检查**: 该论文不涉及安全对齐、多模态视觉或图技术等排除项。虽然论文在HotpotQA等数据集上进行实验，但其核心贡献在于提出了新的智能体框架和训练机制，而非单纯将现有模型应用于特定领域。 综上所述，该论文在构建多智能体协作框架及引入自我博弈演化机制方面做出了实质性贡献，符合筛选要求。", "summary2": "本文旨在优化单一语言模型在复杂推理任务中的局限性。针对多跳问答等场景，我们提出了一种Group Deliberation Multi-Agent Dialogue Model，构建“Generation-Verification-Integration”三级角色分工架构，引入Self-game mechanism和Retrieval Enhancement Module。在HotpotQA、2WikiMultihopQA和MeetingBank数据集上，通过Multi-hop reasoning accuracy和Consistency index验证了其有效性，显著提升了推理准确性与一致性。", "inspiration_trace": "生成灵感溯源时发生错误", "summary_translation": "翻译失败", "summary_generated_time": "2026-01-09 17:26:51", "summary_model": "z-ai/glm-4.7"}]}, {"name": "Computation and Language", "count": 1, "papers": [{"index": "#17", "title": "R-Debater: Retrieval-Augmented Debate Generation through Argumentative Memory", "link": "/arxiv/2512.24684", "arxiv_id": "2512.24684", "authors": "Maoyuan Li, Zhongsheng Wang, Haoyuan Li, Jiamou Liu", "summary": "We present R-Debater, an agentic framework for generating multi-turn debates built on argumentative memory. Grounded in rhetoric and memory studies, the system views debate as a process of recalling and adapting prior arguments to maintain stance consistency, respond to opponents, and support claims with evidence. Specifically, R-Debater integrates a debate knowledge base for retrieving case-like evidence and prior debate moves with a role-based agent that composes coherent utterances across turns. We evaluate on standardized ORCHID debates, constructing a 1,000-item retrieval corpus and a held-out set of 32 debates across seven domains. Two tasks are evaluated: next-utterance generation, assessed by InspireScore (subjective, logical, and factual), and adversarial multi-turn simulations, judged by Debatrix (argument, source, language, and overall). Compared with strong LLM baselines, R-Debater achieves higher single-turn and multi-turn scores. Human evaluation with 20 experienced debaters further confirms its consistency and evidence use, showing that combining retrieval grounding with structured planning yields more faithful, stance-aligned, and coherent debates across turns.", "subjects": "Computation and Language, Artificial Intelligence", "date": "2025-12-31", "category": "cs.CL", "crawl_time": "2026-01-05T11:00:04.813849", "filter_reason": "1.  **核心判断**：论文明确提出了 R-Debater，这是一个用于生成多轮辩论的 **\"agentic framework\"**（智能体框架）。其核心贡献在于构建了一个结合检索增强和论证记忆的智能体架构，而非仅仅将现有模型作为工具简单应用于辩论领域。这符合“构建、改进 LLM 智能体”的核心目标。 2.  **符合研究焦点**：该研究完全符合 **单智能体** 方向。 *   **记忆**：论文的核心创新点是 \"Argumentative Memory\"（论证记忆），使智能体能够回忆和调整先前的论点。 *   **工具使用**：集成了辩论知识库进行检索，作为智能体获取证据的工具。 *   **规划**：摘要中提到 \"structured planning\"（结构化规划），用于在多轮对话中保持立场一致性和连贯性。 3.  **排除标准检查**： *   论文不涉及安全、对齐、多模态视觉或图技术等排除项。 *   虽然应用场景是辩论，但其重点在于智能体如何通过记忆和规划机制来完成任务，属于智能体能力的构建，而非单纯的非演化型应用。 综上所述，该论文提出了新的智能体框架并深入探讨了记忆与规划机制，符合筛选要求。", "summary2": "本文旨在解决LLM在多轮辩论生成中缺乏事实依据、立场一致性差及跨轮次连贯性弱的问题。针对ORCHID数据集上的多轮辩论场景，我们提出了一种名为R-Debater的框架，该框架集成了检索增强生成与基于角色的智能体，通过检索和重构论证记忆来生成高质量辩论。我们在ORCHID数据集上通过InspireScore和Debatrix指标验证了其有效性，实验表明其在逻辑连贯性和事实准确性上显著优于强基线模型。", "inspiration_trace": "生成灵感溯源时发生错误", "summary_translation": "翻译失败", "summary_generated_time": "2026-01-09 17:26:51", "summary_model": "z-ai/glm-4.7"}]}], "overview": "# 今日AI论文速览 (2025-12-31)\n\n生成每日速览时发生错误: Error code: 522"}