[
    {
        "index": "#62",
        "title": "LinguaGame: A Linguistically Grounded Game-Theoretic Paradigm for Multi-Agent Dialogue Generation",
        "link": "/arxiv/2601.04516",
        "arxiv_id": "2601.04516",
        "authors": "Yuxiao Ye, Yiming Zhang, Yiran Ma, Huiyuan Xie, Huining Zhu, Zhiyuan Liu",
        "summary": "Large Language Models (LLMs) have enabled Multi-Agent Systems (MASs) where agents interact through natural language to solve complex tasks or simulate multi-party dialogues. Recent work on LLM-based MASs has mainly focused on architecture design, such as role assignment and workflow orchestration. In contrast, this paper targets the interaction process itself, aiming to improve agents' communication efficiency by helping them convey their intended meaning more effectively through language. To this end, we propose LinguaGame, a linguistically-grounded game-theoretic paradigm for multi-agent dialogue generation. Our approach models dialogue as a signalling game over communicative intents and strategies, solved with a training-free equilibrium approximation algorithm for inference-time decision adjustment. Unlike prior game-theoretic MASs, whose game designs are often tightly coupled with task-specific objectives, our framework relies on linguistically informed reasoning with minimal task-specific coupling. Specifically, it treats dialogue as intentional and strategic communication, requiring agents to infer what others aim to achieve (intents) and how they pursue those goals (strategies). We evaluate our framework in simulated courtroom proceedings and debates, with human expert assessments showing significant gains in communication efficiency.",
        "subjects": "Computation and Language",
        "date": "2026-01-08",
        "category": "cs.CL",
        "crawl_time": "2026-01-12T11:00:05.113595",
        "filter_reason": "这篇论文完全符合我的研究范围，属于 **Multi-Agent (多智能体)** 方向的前沿研究。具体判断依据如下： 1.  **核心判断 (符合)**: *   论文的核心贡献是提出了一种名为 **LinguaGame** 的新范式，这是一种基于博弈论的多智能体对话生成框架。 *   它不仅仅是应用现有的智能体框架，而是针对多智能体系统的 **交互过程** 本身进行了改进，旨在通过建模意图和策略来提升智能体间的通信效率。这符合“构建、改进 LLM智能体”的核心目标。 2.  **研究焦点匹配 (多智能体)**: *   论文明确属于 **Multi-Agent Systems (MAS)** 范畴。 *   它的核心关注点是多智能体之间的 **Communication (通信)** 和 **Interaction (交互)**。 *   论文涉及智能体如何推断彼此的意图和策略，这属于多智能体协作与博弈中的高级认知能力。 3.  **排除标准检查 (通过)**: *   **非单纯应用**: 虽然论文在模拟法庭和辩论中进行了评估，但其核心贡献是通用的交互机制，而非解决特定领域的业务问题。 *   **非安全/对齐/多模态**: 论文不涉及安全对齐、视觉或多模态内容，纯粹关注语言层面的智能体交互逻辑。 4.  **正面指标**: *   包含核心范式关键词：`Multi-Agent Systems (MAS)`, `Game-Theoretic`。 *   包含多智能体能力关键词：`Communication`, `Negotiation` (隐含在辩论场景中), `Agent Society` (隐含在多智能体环境中)。 综上所述，该论文提出了一种改进多智能体通信机制的新方法，属于 Agentic AI 中多智能体交互的重要进展，因此予以保留。"
    },
    {
        "index": "#5",
        "title": "SimuAgent: An LLM-Based Simulink Modeling Assistant Enhanced with Reinforcement Learning",
        "link": "/arxiv/2601.05187",
        "arxiv_id": "2601.05187",
        "authors": "Yanchang Liang, Xiaowei Zhao",
        "summary": "Large language models (LLMs) have revolutionized text-based code automation, but their potential in graph-oriented engineering workflows remains under-explored. We introduce SimuAgent, an LLM-powered modeling and simulation agent tailored for Simulink. SimuAgent replaces verbose XML with a concise, dictionary-style Python representation, dramatically cutting token counts, improving interpretability, and enabling fast, in-process simulation. A lightweight plan-execute architecture, trained in two stages, equips the agent with both low-level tool skills and high-level design reasoning. To tackle sparse rewards in long-horizon tasks, we propose Reflection-GRPO (ReGRPO), which augments Group Relative Policy Optimization (GRPO) with self-reflection traces that supply rich intermediate feedback, accelerating convergence and boosting robustness. Experiments on SimuBench, our newly released benchmark comprising 5300 multi-domain modeling tasks, show that a Qwen2.5-7B model fine-tuned with SimuAgent converges faster and achieves higher modeling accuracy than standard RL baselines, and even surpasses GPT-4o when evaluated with few-shot prompting on the same benchmark. Ablations confirm that the two-stage curriculum and abstract-reconstruct data augmentation further enhance generalization. SimuAgent trains and runs entirely on-premise with modest hardware, delivering a privacy-preserving, cost-effective solution for industrial model-driven engineering. SimuAgent bridges the gap between LLMs and graphical modeling environments, offering a practical solution for AI-assisted engineering design in industrial settings.",
        "subjects": "Artificial Intelligence",
        "date": "2026-01-08",
        "category": "cs.AI",
        "crawl_time": "2026-01-12T11:00:05.843459",
        "filter_reason": "这篇论文符合筛选标准，主要基于以下判断： 1.  **核心贡献符合“自我演化”与“单智能体”方向**： 论文的核心不仅仅是将LLM应用于Simulink这一特定领域，而是提出了一种新的智能体架构和训练方法。具体而言，它提出了 **Reflection-GRPO (ReGRPO)**，这是一种结合了**自我反思**机制的强化学习算法。该算法通过自我反思痕迹提供中间反馈，解决长视距任务中的稀疏奖励问题，从而加速收敛并提高鲁棒性。这直接对应了筛选标准中的“自我演化”和“自我反思”机制。 2.  **具备明确的Agentic特征**： 论文描述了一个轻量级的 **“计划-执行”架构**，并明确提到该架构赋予智能体低级工具技能和高级设计推理能力。这符合筛选标准中关于“规划”和“工具使用”的正面指标。 3.  **符合“自我演化的应用”例外规则**： 虽然论文的应用场景是Simulink建模（特定工程领域），但根据筛选标准第四步第2点，如果论文的核心是提出一种新的“自我演化”机制（即ReGRPO和两阶段课程学习），即使它被应用在特定领域，也应该保留。本文的重点在于智能体如何通过反思和强化学习进行自我完善和迭代，而非单纯的应用。 综上所述，该论文在构建智能体架构、引入自我反思机制以及通过强化学习实现自我演化方面做出了实质性贡献，符合“LLM智能体及其演化”的研究课题要求。"
    },
    {
        "index": "#10",
        "title": "Controllable Memory Usage: Balancing Anchoring and Innovation in Long-Term Human-Agent Interaction",
        "link": "/arxiv/2601.05107",
        "arxiv_id": "2601.05107",
        "authors": "Muzhao Tian, Zisu Huang, Xiaohua Wang, Jingwen Xu, Zhengkang Guo, Qi Qian, Yuanzhe Shen, Kaitao Song, Jiakang Yuan, Changze Lv, Xiaoqing Zheng",
        "summary": "As LLM-based agents are increasingly used in long-term interactions, cumulative memory is critical for enabling personalization and maintaining stylistic consistency. However, most existing systems adopt an ``all-or-nothing'' approach to memory usage: incorporating all relevant past information can lead to \\textit{Memory Anchoring}, where the agent is trapped by past interactions, while excluding memory entirely results in under-utilization and the loss of important interaction history. We show that an agent's reliance on memory can be modeled as an explicit and user-controllable dimension. We first introduce a behavioral metric of memory dependence to quantify the influence of past interactions on current outputs. We then propose \\textbf{Stee}rable \\textbf{M}emory Agent, \\texttt{SteeM}, a framework that allows users to dynamically regulate memory reliance, ranging from a fresh-start mode that promotes innovation to a high-fidelity mode that closely follows interaction history. Experiments across different scenarios demonstrate that our approach consistently outperforms conventional prompting and rigid memory masking strategies, yielding a more nuanced and effective control for personalized human-agent collaboration.",
        "subjects": "Artificial Intelligence",
        "date": "2026-01-08",
        "category": "cs.AI",
        "crawl_time": "2026-01-12T11:00:05.844939",
        "filter_reason": "这篇论文完全符合我的研究范围，属于“单智能体”方向下的核心研究。 1.  **核心贡献判断 (第一步)**: *   论文的核心贡献是提出了 **SteeM (Steerable Memory Agent)**，这是一个用于LLM智能体的新框架。 *   它旨在解决长期人机交互中智能体如何使用记忆的问题，即如何平衡“记忆锚定”与“创新”。这属于对LLM智能体核心组件（记忆机制）的构建和改进，而非简单的应用或基础设施研究。 2.  **符合核心关注点 (第二步)**: *   论文直接对应我的研究焦点中的 **“单智能体”** 类别。 *   具体而言，它涉及智能体的关键能力指标：**`Memory` (记忆)**。论文探讨了如何量化记忆依赖度以及如何动态调节记忆的使用，这是提升智能体在长期任务中表现的关键技术。 3.  **排除标准检查 (第三步)**: *   论文不涉及安全、对齐、多模态视觉或图技术等排除项。 *   虽然提到了“个性化人机协作”，但这只是应用场景，其核心在于提出一种可控的记忆机制框架，而非单纯解决特定领域的业务问题。 综上所述，该论文致力于改进LLM智能体的记忆机制，属于构建和演化LLM智能体的核心方法论研究，因此予以保留。"
    },
    {
        "index": "#28",
        "title": "SmartSearch: Process Reward-Guided Query Refinement for Search Agents",
        "link": "/arxiv/2601.04888",
        "arxiv_id": "2601.04888",
        "authors": "Tongyu Wen, Guanting Dong, Zhicheng Dou",
        "summary": "Large language model (LLM)-based search agents have proven promising for addressing knowledge-intensive problems by incorporating information retrieval capabilities. Existing works largely focus on optimizing the reasoning paradigms of search agents, yet the quality of intermediate search queries during reasoning remains overlooked. As a result, the generated queries often remain inaccurate, leading to unexpected retrieval results and ultimately limiting search agents' overall effectiveness. To mitigate this issue, we introduce SmartSearch, a framework built upon two key mechanisms: (1) Process rewards, which provide fine-grained supervision for the quality of each intermediate search query through Dual-Level Credit Assessment. (2) Query refinement, which promotes the optimization of query generation by selectively refining low-quality search queries and regenerating subsequent search rounds based on these refinements. To enable the search agent to progressively internalize the ability to improve query quality under the guidance of process rewards, we design a three-stage curriculum learning framework. This framework guides the agent through a progression from imitation, to alignment, and ultimately to generalization. Experimental results show that SmartSearch consistently surpasses existing baselines, and additional quantitative analyses further confirm its significant gains in both search efficiency and query quality. The code is available at https://github.com/MYVAE/SmartSearch.",
        "subjects": "Artificial Intelligence",
        "date": "2026-01-08",
        "category": "cs.AI",
        "crawl_time": "2026-01-12T11:00:05.850247",
        "filter_reason": "这篇论文完全符合我的研究范围，理由如下： 1.  **核心判断**: *   论文的核心贡献是提出了 **SmartSearch**，这是一个专门用于改进 **LLM-based search agents**（基于LLM的搜索智能体）的新框架。 *   它不是简单地将智能体作为工具应用到特定垂直领域（如医疗或金融），而是专注于解决智能体本身在执行搜索任务时的核心缺陷（即中间搜索查询质量不高），属于对智能体能力的底层构建和改进。 2.  **符合研究焦点**: *   **单智能体**: 论文明确针对搜索智能体的架构进行优化，涉及智能体的 **Tool Use**（使用搜索工具）和 **Planning**（生成查询的推理过程）。 *   **自我演化**: 论文引入了“过程奖励”和“查询优化”机制，并设计了一个三阶段的课程学习框架（模仿 -> 对齐 -> 泛化）。这种机制旨在让智能体通过反馈信号，逐步内化并自我改进其生成查询的能力。这符合“自我演化”中通过环境反馈进行自我完善和迭代的标准。 3.  **排除标准检查**: *   论文不涉及安全、对齐、可解释性或水印等排除主题。 *   论文不涉及多模态或视觉技术。 *   论文不涉及知识图谱或图神经网络。 综上所述，该论文通过提出新的方法论来提升LLM智能体的工具使用效率和自我优化能力，高度契合“LLM智能体及其演化”的研究课题。"
    },
    {
        "index": "#33",
        "title": "Orchestrating Intelligence: Confidence-Aware Routing for Efficient Multi-Agent Collaboration across Multi-Scale Models",
        "link": "/arxiv/2601.04861",
        "arxiv_id": "2601.04861",
        "authors": "Jingbo Wang, Sendong Zhao, Jiatong Liu, Haochun Wang, Wanting Li, Bing Qin, Ting Liu",
        "summary": "While multi-agent systems (MAS) have demonstrated superior performance over single-agent approaches in complex reasoning tasks, they often suffer from significant computational inefficiencies. Existing frameworks typically deploy large language models (LLMs) uniformly across all agent roles, failing to account for the varying cognitive demands of different reasoning stages. We address this inefficiency by proposing OI-MAS framework, a novel multi-agent framework that implements an adaptive model-selection policy across a heterogeneous pool of multi-scale LLMs. Specifically, OI-MAS introduces a state-dependent routing mechanism that dynamically selects agent roles and model scales throughout the reasoning process. In addition, we introduce a confidence-aware mechanism that selects appropriate model scales conditioned on task complexity, thus reducing unnecessary reliance on large-scale models. Experimental results show that OI-MAS consistently outperforms baseline multi-agent systems, improving accuracy by up to 12.88\\% while reducing cost by up to 79.78\\%.",
        "subjects": "Artificial Intelligence",
        "date": "2026-01-08",
        "category": "cs.AI",
        "crawl_time": "2026-01-12T11:00:05.851663",
        "filter_reason": "这篇论文完全符合筛选标准，属于“多智能体”方向的核心研究。 1.  **核心判断（符合）**：论文的本质是构建和改进 LLM 智能体框架。作者提出了 OI-MAS（Orchestrating Intelligence），这是一个新颖的多智能体系统框架。它并非将智能体作为工具应用于特定垂直领域（如医疗或金融），而是针对多智能体系统本身的“计算效率低下”这一痛点，提出了新的架构解决方案（自适应模型选择策略和状态依赖路由机制）。这属于对智能体框架的改进和优化。 2.  **正面指标（强匹配）**： *   **核心范式**：明确属于 `Multi-Agent Systems (MAS)`。 *   **多智能体能力**：论文重点研究了智能体间的 `Collaboration`（协作），并引入了机制来动态选择智能体角色和模型尺度。 *   **优化机制**：虽然涉及效率，但其核心是通过智能体层面的“路由”和“置信度感知”来实现的，这是提升多智能体系统性能的关键技术，属于构建智能体方法论的一部分。 3.  **排除标准（无冲突）**：论文不涉及安全对齐、多模态视觉或图技术，也不是单纯的基础设施研究。 综上所述，该论文致力于解决多智能体协作中的效率与资源分配问题，是对 LLM 智能体架构的直接改进，符合“构建、改进或演化 LLM 智能体”的核心目标。"
    },
    {
        "index": "#49",
        "title": "Beyond Monolithic Architectures: A Multi-Agent Search and Knowledge Optimization Framework for Agentic Search",
        "link": "/arxiv/2601.04703",
        "arxiv_id": "2601.04703",
        "authors": "Yiqun Chen, Lingyong Yan, Zixuan Yang, Erhan Zhang, Jiashu Zhao, Shuaiqiang Wang, Dawei Yin, Jiaxin Mao",
        "summary": "Agentic search has emerged as a promising paradigm for complex information seeking by enabling Large Language Models (LLMs) to interleave reasoning with tool use. However, prevailing systems rely on monolithic agents that suffer from structural bottlenecks, including unconstrained reasoning outputs that inflate trajectories, sparse outcome-level rewards that complicate credit assignment, and stochastic search noise that destabilizes learning. To address these challenges, we propose \\textbf{M-ASK} (Multi-Agent Search and Knowledge), a framework that explicitly decouples agentic search into two complementary roles: Search Behavior Agents, which plan and execute search actions, and Knowledge Management Agents, which aggregate, filter, and maintain a compact internal context. This decomposition allows each agent to focus on a well-defined subtask and reduces interference between search and context construction. Furthermore, to enable stable coordination, M-ASK employs turn-level rewards to provide granular supervision for both search decisions and knowledge updates. Experiments on multi-hop QA benchmarks demonstrate that M-ASK outperforms strong baselines, achieving not only superior answer accuracy but also significantly more stable training dynamics.\\footnote{The source code for M-ASK is available at https://github.com/chenyiqun/M-ASK.}",
        "subjects": "Artificial Intelligence",
        "date": "2026-01-08",
        "category": "cs.AI",
        "crawl_time": "2026-01-12T11:00:05.856378",
        "filter_reason": "这篇论文完全符合筛选标准，属于核心研究范围内的“多智能体”方向。 1.  **核心判断 (第一步)**: *   论文的核心贡献是提出了 **M-ASK (Multi-Agent Search and Knowledge)**，这是一个新的**多智能体框架**。 *   它旨在解决现有单体智能体在 Agentic Search 任务中的结构性瓶颈，而非仅仅将现有模型应用到一个特定领域。因此，它属于构建和改进 LLM 智能体的方法论研究，符合“保留”标准。 2.  **正面指标匹配 (第二步)**: *   **核心范式**: 论文明确涉及 `Multi-Agent Systems (MAS)` 和 `Agentic AI`。 *   **多智能体**: 论文将智能体解耦为两个互补的角色：`Search Behavior Agents`（负责规划和执行搜索动作）和 `Knowledge Management Agents`（负责聚合、过滤和维护内部上下文）。这体现了智能体间的协作与分工。 *   **智能体能力**: 涉及 `Planning`（规划搜索动作）、`Tool Use`（工具使用）以及 `Memory`（通过知识管理智能体维护内部上下文）。 3.  **排除标准检查 (第三步)**: *   论文不涉及安全、对齐、多模态视觉或图技术等排除项。 4.  **特殊与模糊情况处理 (第四步)**: *   虽然论文在 Multi-hop QA（多跳问答）基准测试上进行了实验，但这只是为了验证框架的有效性，其核心在于提出了一种新的多智能体协作架构来优化 Agentic Search，而非单纯的应用型研究。 综上所述，该论文通过构建多智能体系统来改进 LLM 智能体的搜索与推理能力，精准契合“多智能体”这一研究焦点。"
    },
    {
        "index": "#59",
        "title": "AgentDevel: Reframing Self-Evolving LLM Agents as Release Engineering",
        "link": "/arxiv/2601.04620",
        "arxiv_id": "2601.04620",
        "authors": "Di Zhang",
        "summary": "Recent progress in large language model (LLM) agents has largely focused on embedding self-improvement mechanisms inside the agent or searching over many concurrent variants. While these approaches can raise aggregate scores, they often yield unstable and hard-to-audit improvement trajectories, making it difficult to guarantee non-regression or to reason about failures across versions. We reframe agent improvement as \\textbf{release engineering}: agents are treated as shippable artifacts, and improvement is externalized into a regression-aware release pipeline. We introduce \\textbf{AgentDevel}, a release engineering pipeline that iteratively runs the current agent, produces implementation-blind, symptom-level quality signals from execution traces, synthesizes a single release candidate (RC) via executable diagnosis, and promotes it under flip-centered gating. AgentDevel features three core designs: (i) an implementation-blind LLM critic that characterizes failure appearances without accessing agent internals, (ii) script-based executable diagnosis that aggregates dominant symptom patterns and produces auditable engineering specifications, and (iii) flip-centered gating that prioritizes pass to fail regressions and fail to pass fixes as first-class evidence. Unlike population-based search or in-agent self-refinement, AgentDevel maintains a single canonical version line and emphasizes non-regression as a primary objective. Experiments on execution-heavy benchmarks demonstrate that AgentDevel yields stable improvements with significantly fewer regressions while producing reproducible, auditable artifacts. Overall, AgentDevel provides a practical development discipline for building, debugging, and releasing LLM agents as software development.",
        "subjects": "Artificial Intelligence",
        "date": "2026-01-08",
        "category": "cs.AI",
        "crawl_time": "2026-01-12T11:00:05.859191",
        "filter_reason": "1.  **核心判断**: 论文的核心贡献是提出了 **AgentDevel**，这是一个将 LLM 智能体的自我改进过程重构为“发布工程”的新框架。它通过迭代运行智能体、生成质量信号、诊断故障并合成新版本，实现了智能体的自我演化。这完全符合“构建、改进或演化 LLM 智能体”的目标，不属于非演化型应用、非Agentic的基础推理或基础设施研究。 2.  **研究焦点匹配**: 论文直接对应研究焦点的第三点 **“自我演化”**。它提出了一种新的演化机制，即通过外部化的回归感知发布管道来迭代改进智能体，这与传统的内部自我反思或基于种群的搜索不同，强调了演化的稳定性和可审计性。 3.  **正面指标**: 论文明确涉及 `Self-Evolving`、`Self-Improvement`、`Iterative Improvement`、`Agentic AI` 以及 `LLM-based Agents` 等核心范式和能力。 4.  **排除标准**: 论文不涉及安全对齐、多模态技术或特定领域的垂直应用（如医疗、金融），也不属于基础设施优化。 5.  **结论**: 该论文为 LLM 智能体的演化提供了新的方法论视角，属于前沿研究，应予以保留。"
    },
    {
        "index": "#69",
        "title": "TCAndon-Router: Adaptive Reasoning Router for Multi-Agent Collaboration",
        "link": "/arxiv/2601.04544",
        "arxiv_id": "2601.04544",
        "authors": "Jiuzhou Zhao, Chunrong Chen, Chenqi Qiao, Lebin Zheng, Minqi Han, Yanchi Liu Yongzhou Xu Xiaochuan Xu Min Zhang",
        "summary": "Multi-Agent Systems(MAS) have become a powerful paradigm for building high performance intelligent applications. Within these systems, the router responsible for determining which expert agents should handle a given query plays a crucial role in overall performance. Existing routing strategies generally fall into two categories: performance routing, which balances latency and cost across models of different sizes, and task routing, which assigns queries to domain-specific experts to improve accuracy. In real-world enterprise applications, task routing is more suitable; however, most existing approaches rely on static single-label decisions, which introduce two major limitations: (i) difficulty in seamlessly integrating new agents as business domains expand, and (ii) routing conflicts caused by overlapping agent capabilities, ultimately degrading accuracy and robustness.To address these challenges, we propose TCAndon-Router(TCAR): an adaptive reasoning router for multi-agent collaboration. Unlike traditional routers, TCAR supports dynamic agent onboarding and first generates a natural-language reasoning chain before predicting a set of candidate agents capable of handling the query. In addition, we design a collaborative execution pipeline in which selected agents independently produce responses, which are then aggregated and refined into a single high-quality response by a dedicated Refining Agent.Experiments on public datasets and real enterprise data demonstrate that TCAR significantly improves routing accuracy, reduces routing conflicts, and remains robust in ambiguous scenarios. We have released TCAR at https://huggingface.co/tencent/TCAndon-Router to support future research on explainable and collaborative multi-agent routing.",
        "subjects": "Artificial Intelligence",
        "date": "2026-01-08",
        "category": "cs.AI",
        "crawl_time": "2026-01-12T11:00:05.862038",
        "filter_reason": "这篇论文完全符合筛选标准，属于“多智能体”方向的核心研究。 1.  **核心判断（第一步）**： *   论文的核心贡献是提出了 **TCAndon-Router (TCAR)**，这是一个用于多智能体协作的自适应推理路由器。 *   它不仅仅是应用现有的智能体框架，而是针对多智能体系统（MAS）中的关键组件——路由器——进行了构建和改进。 *   论文设计了一个“协作执行流水线”，其中包括一个专门的“Refining Agent”来聚合和优化响应，这属于构建新的多智能体交互机制。 2.  **正面指标（第二步）**： *   **核心范式**：明确属于 `Multi-Agent Systems (MAS)`。 *   **多智能体特性**：涉及 `Collaboration`（协作执行流水线）、`Communication`（通过路由器进行任务分配）以及 `Agent Society`（支持动态智能体接入）。 *   **智能体能力**：利用 `Reasoning`（生成自然语言推理链）来辅助路由决策。 3.  **排除标准（第三步）**： *   论文不涉及安全、对齐、多模态视觉或图技术等排除项。 4.  **综合结论**： 该论文致力于解决多智能体系统中的任务分配与协作效率问题，提出了新的路由机制和协作框架，直接对应研究课题中的“多智能体”方向，因此应当保留。"
    },
    {
        "index": "#75",
        "title": "GUITester: Enabling GUI Agents for Exploratory Defect Discovery",
        "link": "/arxiv/2601.04500",
        "arxiv_id": "2601.04500",
        "authors": "Yifei Gao, Jiang Wu, Xiaoyi Chen, Yifan Yang, Zhe Cui, Tianyi Ma, Jiaming Zhang, Jitao Sang",
        "summary": "Exploratory GUI testing is essential for software quality but suffers from high manual costs. While Multi-modal Large Language Model (MLLM) agents excel in navigation, they fail to autonomously discover defects due to two core challenges: \\textit{Goal-Oriented Masking}, where agents prioritize task completion over reporting anomalies, and \\textit{Execution-Bias Attribution}, where system defects are misidentified as agent errors. To address these, we first introduce \\textbf{GUITestBench}, the first interactive benchmark for this task, featuring 143 tasks across 26 defects. We then propose \\textbf{GUITester}, a multi-agent framework that decouples navigation from verification via two modules: (i) a \\textit{Planning-Execution Module (PEM)} that proactively probes for defects via embedded testing intents, and (ii) a \\textit{Hierarchical Reflection Module (HRM)} that resolves attribution ambiguity through interaction history analysis. GUITester achieves an F1-score of 48.90\\% (Pass@3) on GUITestBench, outperforming state-of-the-art baselines (33.35\\%). Our work demonstrates the feasibility of autonomous exploratory testing and provides a robust foundation for future GUI quality assurance~\\footnote{Our code is now available in~\\href{https://github.com/ADaM-BJTU/GUITestBench}{https://github.com/ADaM-BJTU/GUITestBench}}.",
        "subjects": "Artificial Intelligence",
        "date": "2026-01-08",
        "category": "cs.AI",
        "crawl_time": "2026-01-12T11:00:05.863714",
        "filter_reason": "这篇论文符合筛选标准，应予以保留。判断依据如下： 1.  **核心贡献符合要求 (第一步 & 第二步)**: *   论文的核心贡献是提出了 **GUITester**，这是一个**多智能体框架**。它不仅仅是将现有的LLM智能体作为工具应用，而是构建了一个新的架构来解决特定问题。 *   该框架包含两个关键模块：**规划-执行模块 (PEM)** 和 **层次化反思模块 (HRM)**。这直接对应了研究焦点中的 **\"Agentic\" (规划)** 和 **\"自我演化\" (自我反思 Self-Reflection / 自我修正 Self-Correction)** 方向。 2.  **涉及多智能体与自我反思机制 (第二步 & 第四步)**: *   论文明确属于 **Multi-Agent Systems (MAS)** 范畴。 *   论文提出的 **HRM (Hierarchical Reflection Module)** 通过分析交互历史来解决归因歧义，这是一种典型的 **自我反思** 和 **自我修正** 机制。虽然它应用于GUI测试，但其核心在于改进智能体处理反馈和自我完善的能力，符合“自我演化”中通过反思进行迭代的定义。 3.  **特殊情况的正确处理 (第三步 & 第四步)**: *   **应用 vs. 方法论**: 虽然论文的应用场景是GUI测试（特定领域），但其核心在于提出了解决“目标导向掩蔽”和“执行偏差归因”的**新方法论**（即解耦导航与验证的框架），而非单纯的应用。 *   **多模态**: 论文虽然使用了多模态大模型 (MLLM) 来感知GUI界面，但视觉仅作为智能体感知环境的工具，研究的核心并非视觉模型的改进，而是智能体的决策与反思框架，因此符合“除非它们被用作智能体感知环境的工具”的例外条款。 综上所述，该论文在构建多智能体框架、引入规划机制以及实现自我反思方面做出了实质性贡献，完全符合“LLM智能体及其演化”的研究课题。"
    },
    {
        "index": "#98",
        "title": "Actively Obtaining Environmental Feedback for Autonomous Action Evaluation Without Predefined Measurements",
        "link": "/arxiv/2601.04235",
        "arxiv_id": "2601.04235",
        "authors": "Hong Su",
        "summary": "Obtaining reliable feedback from the environment is a fundamental capability for intelligent agents to evaluate the correctness of their actions and to accumulate reusable knowledge. However, most existing approaches rely on predefined measurements or fixed reward signals, which limits their applicability in open-ended and dynamic environments where new actions may require previously unknown forms of feedback. To address these limitations, this paper proposes an Actively Feedback Getting model, in which an AI agent proactively interacts with the environment to discover, screen, and verify feedback without relying on predefined measurements. Rather than assuming explicit feedback definitions, the proposed method exploits action-induced environmental differences to identify target feedback that is not specified in advance, based on the observation that actions inevitably produce measurable changes in the environment. In addition, a self-triggering mechanism, driven by internal objectives such as improved accuracy, precision, and efficiency, is introduced to autonomously plan and adjust actions, thereby enabling faster and more focused feedback acquisition without external commands. Experimental results demonstrate that the proposed active approach significantly improves the efficiency and robustness of factor identification.",
        "subjects": "Artificial Intelligence",
        "date": "2026-01-04",
        "category": "cs.AI",
        "crawl_time": "2026-01-12T11:00:05.870053",
        "filter_reason": "这篇论文完全符合筛选标准，属于核心研究范围内的“单智能体”与“自我演化”交叉领域。 1.  **核心贡献符合要求 (第一步)**: 论文的核心贡献是提出了一种“主动获取反馈”的模型。这不仅仅是应用现有智能体解决具体问题，而是构建了一种新的智能体交互与评估机制，使智能体能够在没有预设测量的情况下，通过主动与环境交互来获取反馈。这属于构建和改进LLM智能体方法论的研究。 2.  **高度匹配核心关注点 (第二步)**: *   **单智能体**: 论文详细探讨了智能体如何进行“自主行动评估”、“与环境交互”以及“自主规划和调整行动”，这直接对应了Agentic AI中的规划、工具使用和环境交互能力。 *   **自我演化**: 论文引入了“自触发机制”，允许智能体根据内部目标（如准确性、效率）自主调整行动。这种基于反馈的自我调整和迭代优化，正是“自我演化”和“自我修正”的关键体现。 3.  **通过排除标准检查 (第三步)**: *   论文不涉及安全、对齐、多模态视觉核心或图技术等排除项。 *   它不是非演化型应用，而是提出了一种通用的智能体能力增强机制。 综上所述，该论文通过解决智能体如何在开放环境中自主获取反馈并自我完善的问题，为Agentic AI的演化和能力提升提供了新的方法论，因此应当保留。"
    }
]