[
    {
        "index": "#1",
        "title": "Knowledge Base-Aware Orchestration: A Dynamic, Privacy-Preserving Method for Multi-Agent Systems",
        "link": "/arxiv/2509.19599",
        "arxiv_id": "2509.19599",
        "authors": "Danilo Trombino, Vincenzo Pecorella, Alessandro de Giulii, Davide Tresoldi",
        "summary": "Multi-agent systems (MAS) are increasingly tasked with solving complex, knowledge-intensive problems where effective agent orchestration is critical. Conventional orchestration methods rely on static agent descriptions, which often become outdated or incomplete. This limitation leads to inefficient task routing, particularly in dynamic environments where agent capabilities continuously evolve. We introduce Knowledge Base-Aware (KBA) Orchestration, a novel approach that augments static descriptions with dynamic, privacy-preserving relevance signals derived from each agent's internal knowledge base (KB). In the proposed framework, when static descriptions are insufficient for a clear routing decision, the orchestrator prompts the subagents in parallel. Each agent then assesses the task's relevance against its private KB, returning a lightweight ACK signal without exposing the underlying data. These collected signals populate a shared semantic cache, providing dynamic indicators of agent suitability for future queries. By combining this novel mechanism with static descriptions, our method achieves more accurate and adaptive task routing preserving agent autonomy and data confidentiality. Benchmarks show that our KBA Orchestration significantly outperforms static description-driven methods in routing precision and overall system efficiency, making it suitable for large-scale systems that require higher accuracy than standard description-driven routing.",
        "subjects": "Multiagent Systems, Artificial Intelligence",
        "date": "2025-09-23",
        "category": "cs.MA",
        "crawl_time": "2025-09-25T12:59:30.918109"
    },
    {
        "index": "#2",
        "title": "The Heterogeneous Multi-Agent Challenge",
        "link": "/arxiv/2509.19512",
        "arxiv_id": "2509.19512",
        "authors": "Charles Dansereau, Junior-Samuel Lopez-Yepez, Karthik Soma, Antoine Fagette",
        "summary": "Multi-Agent Reinforcement Learning (MARL) is a growing research area which gained significant traction in recent years, extending Deep RL applications to a much wider range of problems. A particularly challenging class of problems in this domain is Heterogeneous Multi-Agent Reinforcement Learning (HeMARL), where agents with different sensors, resources, or capabilities must cooperate based on local information. The large number of real-world situations involving heterogeneous agents makes it an attractive research area, yet underexplored, as most MARL research focuses on homogeneous agents (e.g., a swarm of identical robots). In MARL and single-agent RL, standardized environments such as ALE and SMAC have allowed to establish recognized benchmarks to measure progress. However, there is a clear lack of such standardized testbed for cooperative HeMARL. As a result, new research in this field often uses simple environments, where most algorithms perform near optimally, or uses weakly heterogeneous MARL environments.",
        "subjects": "Multiagent Systems, Artificial Intelligence",
        "date": "2025-09-23",
        "category": "cs.MA",
        "crawl_time": "2025-09-25T12:59:30.918323"
    },
    {
        "index": "#3",
        "title": "Adaptive Event-Triggered Policy Gradient for Multi-Agent Reinforcement Learning",
        "link": "/arxiv/2509.20338",
        "arxiv_id": "2509.20338",
        "authors": "Umer Siddique, Abhinav Sinha, Yongcan Cao",
        "summary": "Conventional multi-agent reinforcement learning (MARL) methods rely on time-triggered execution, where agents sample and communicate actions at fixed intervals. This approach is often computationally expensive and communication-intensive. To address this limitation, we propose ET-MAPG (Event-Triggered Multi-Agent Policy Gradient reinforcement learning), a framework that jointly learns an agent's control policy and its event-triggering policy. Unlike prior work that decouples these mechanisms, ET-MAPG integrates them into a unified learning process, enabling agents to learn not only what action to take but also when to execute it. For scenarios with inter-agent communication, we introduce AET-MAPG, an attention-based variant that leverages a self-attention mechanism to learn selective communication patterns. AET-MAPG empowers agents to determine not only when to trigger an action but also with whom to communicate and what information to exchange, thereby optimizing coordination. Both methods can be integrated with any policy gradient MARL algorithm. Extensive experiments across diverse MARL benchmarks demonstrate that our approaches achieve performance comparable to state-of-the-art, time-triggered baselines while significantly reducing both computational load and communication overhead.",
        "subjects": "Systems and Control, Artificial Intelligence, Multiagent Systems, Dynamical Systems",
        "date": "2025-09-24",
        "category": "cs.MA",
        "crawl_time": "2025-09-25T12:59:30.918524"
    },
    {
        "index": "#4",
        "title": "On Robustness of Consensus over Pseudo-Undirected Path Graphs",
        "link": "/arxiv/2509.20314",
        "arxiv_id": "2509.20314",
        "authors": "Abhinav Sinha, Dwaipayan Mukherjee, Shashi Ranjan Kumar",
        "summary": "Consensus over networked agents is typically studied using undirected or directed communication graphs. Undirected graphs enforce symmetry in information exchange, leading to convergence to the average of initial states, while directed graphs permit asymmetry but make consensus dependent on root nodes and their influence. Both paradigms impose inherent restrictions on achievable consensus values and network robustness. This paper introduces a theoretical framework for achieving consensus over a class of network topologies, termed pseudo-undirected graphs, which retains bidirectional connectivity between node pairs but allows the corresponding edge weights to differ, including the possibility of negative values under bounded conditions. The resulting Laplacian is generally non-symmetric, yet it guarantees consensus under connectivity assumptions, to expand the solution space, which enables the system to achieve a stable consensus value that can lie outside the convex hull of the initial state set. We derive admissibility bounds for negative weights for a pseudo-undirected path graph, and show an application in the simultaneous interception of a moving target.",
        "subjects": "Systems and Control, Multiagent Systems, Robotics, Dynamical Systems, Optimization and Control",
        "date": "2025-09-24",
        "category": "cs.MA",
        "crawl_time": "2025-09-25T12:59:30.918720"
    },
    {
        "index": "#5",
        "title": "Choose Your Battles: Distributed Learning Over Multiple Tug of War Games",
        "link": "/arxiv/2509.20147",
        "arxiv_id": "2509.20147",
        "authors": "Siddharth Chandak, Ilai Bistritz, Nicholas Bambos",
        "summary": "Consider N players and K games taking place simultaneously. Each of these games is modeled as a Tug-of-War (ToW) game where increasing the action of one player decreases the reward for all other players. Each player participates in only one game at any given time. At each time step, a player decides the game in which they wish to participate in and the action they take in that game. Their reward depends on the actions of all players that are in the same game. This system of K games is termed `Meta Tug-of-War' (Meta-ToW) game. These games can model scenarios such as power control, distributed task allocation, and activation in sensor networks. We propose the Meta Tug-of-Peace algorithm, a distributed algorithm where the action updates are done using a simple stochastic approximation algorithm, and the decision to switch games is made using an infrequent 1-bit communication between the players. We prove that in Meta-ToW games, our algorithm converges to an equilibrium that satisfies a target Quality of Service reward vector for the players. We then demonstrate the efficacy of our algorithm through simulations for the scenarios mentioned above.",
        "subjects": "Computer Science and Game Theory, Machine Learning, Multiagent Systems, Systems and Control",
        "date": "2025-09-24",
        "category": "cs.MA",
        "crawl_time": "2025-09-25T12:59:30.918907"
    },
    {
        "index": "#6",
        "title": "AEGIS: Automated Error Generation and Identification for Multi-Agent Systems",
        "link": "/arxiv/2509.14295",
        "arxiv_id": "2509.14295",
        "authors": "Fanqi Kong, Ruijie Zhang, Huaxiao Yin, Guibin Zhang, Xiaofei Zhang, Ziang Chen, Zhaowei Zhang, Xiaoyuan Zhang, Song-Chun Zhu, Xue Feng",
        "summary": "As Multi-Agent Systems (MAS) become increasingly autonomous and complex, understanding their error modes is critical for ensuring their reliability and safety. However, research in this area has been severely hampered by the lack of large-scale, diverse datasets with precise, ground-truth error labels. To address this bottleneck, we introduce \\textbf{AEGIS}, a novel framework for \\textbf{A}utomated \\textbf{E}rror \\textbf{G}eneration and \\textbf{I}dentification for Multi-Agent \\textbf{S}ystems. By systematically injecting controllable and traceable errors into initially successful trajectories, we create a rich dataset of realistic failures. This is achieved using a context-aware, LLM-based adaptive manipulator that performs sophisticated attacks like prompt injection and response corruption to induce specific, predefined error modes. We demonstrate the value of our dataset by exploring three distinct learning paradigms for the error identification task: Supervised Fine-Tuning, Reinforcement Learning, and Contrastive Learning. Our comprehensive experiments show that models trained on AEGIS data achieve substantial improvements across all three learning paradigms. Notably, several of our fine-tuned models demonstrate performance competitive with or superior to proprietary systems an order of magnitude larger, validating our automated data generation framework as a crucial resource for developing more robust and interpretable multi-agent systems. Our project website is available at https://kfq20.github.io/AEGIS-Website.",
        "subjects": "Robotics",
        "date": "2025-09-17",
        "category": "cs.MA",
        "crawl_time": "2025-09-25T12:59:30.919205"
    }
]